#encoding:utf-8
#==============================================================================
# ■ Window_BattleSkill
#------------------------------------------------------------------------------
# 　戰斗畫面中，選擇“使用技能”的窗口。
#==============================================================================

class Window_BattleSkill < Window_SkillList
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #     info_viewport : 信息顯示用顯示端口
  #--------------------------------------------------------------------------
  def initialize(help_window, info_viewport)
    y = help_window.height
    super(0, y, Graphics.width, info_viewport.rect.y - y)
    self.visible = false
    @help_window = help_window
    @info_viewport = info_viewport
  end
  #--------------------------------------------------------------------------
  # ● 顯示窗口
  #--------------------------------------------------------------------------
  def show
    select_last
    @help_window.show
    super
  end
  #--------------------------------------------------------------------------
  # ● 隱藏窗口
  #--------------------------------------------------------------------------
  def hide
    @help_window.hide
    super
  end
end
