#預設字形
#
#能用腳本來改。
#在Main這邊於
#
#    rgss_main { SceneManager.run }
#
#之前插入一個這樣的腳本就行了
#
#   Font.default_name = 'PMingLiU'
#
#改成自己想要的字體，
#當然別忘了，要配布的時候請附上你用的字體，或者是放連結，
#一般來講Windows Vista和Windows 7(Windows 8應該也如是)
#都已經內建微軟正黑體，
#Winodws 95、98、Me、2000與XP則可以到微軟的官網下載該字體。
#與此相對的簡體字體是微軟雅黑體。
#
#這邊特別說一下，
#一般大家電腦會安裝的字體除了上面提到的微軟正黑體與微軟雅黑體外，
#還有新細明體(簡體為新宋體)、細明體(簡體為中易宋體)、
#標楷體(簡體版為楷體)、中易黑體，
#如非必要，最好不要用這九個字形以外的任何字形，
#免得到時別人玩你的遊戲時頻頻跳出找不到字體
#或甚至完全看不到字的時候弄得一肚子火。
#(真的需要的話，請用圖片檔替代)
#
#(以RMVA的畫面而言，中國式的GAME適用標楷體/楷體、其他的則適合微軟正黑/雅黑體)
#
#然後正體/簡體的字體因為兩邊的電腦顯示名稱不同，
#用中文的字形名很可能也會跑不出字體，所以建議用英文的字形名字：
#
#微軟正黑體→Microsoft JhengHei
#微軟雅黑體→Microsoft YaHei
#新細明體→PMingLiU
#細明體→MingLiU
#中易宋體→SimSun
#新宋體→NSimSun
#標楷體→DFKai-SB
#楷體→KaiTi
#中易黑體→SimHei
#
#這樣子不管在哪一台電腦上跑，基本上應該都跑得出來。
#
#
#
#