#encoding:utf-8
#==============================================================================
# ■ Sprite_SlidingBase
#------------------------------------------------------------------------------
# 　實現基礎移動模式的精靈，包含明暗及縮放變化
#==============================================================================

class Sprite_SlidingBase < Sprite_Base
  #--------------------------------------------------------------------------
  # ● 定義實例變量
  #--------------------------------------------------------------------------
  attr_accessor :opacity_max # 從外部限制最大透明度
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #--------------------------------------------------------------------------
  def initialize(viewport = nil)
    super(viewport)
    @opacity_max = 255
    self.x = init_x
    self.y = init_y
    self.opacity = init_opacity
    self.zoom_x = init_zoom_x
    self.zoom_y = init_zoom_y
    @slided_in = false
    @slided_out = true
    @slide_count = 0
    @sliding_in = false
    @sliding_out = false
    @in_process = true
    @out_process = true
    @real_x = self.x.to_f
    @real_opacity = self.opacity.to_f
    @real_y = self.y.to_f
    @real_angle = self.angle.to_f
    @angle_change_count = 0
  end
  #--------------------------------------------------------------------------
  # ● 初始X座標
  #--------------------------------------------------------------------------
  def init_x
    0
  end
  #--------------------------------------------------------------------------
  # ● 初始Y座標
  #--------------------------------------------------------------------------
  def init_y
    0
  end
  #--------------------------------------------------------------------------
  # ● 初始透明度
  #--------------------------------------------------------------------------
  def init_opacity
    0
  end
  #--------------------------------------------------------------------------
  # ● 初始橫向放大率
  #--------------------------------------------------------------------------
  def init_zoom_x
    1.0
  end
  #--------------------------------------------------------------------------
  # ● 初始縱向放大率
  #--------------------------------------------------------------------------
  def init_zoom_y
    1.0
  end
  #--------------------------------------------------------------------------
  # ● 飛入開始橫向放大率
  #--------------------------------------------------------------------------
  def slide_in_start_zoom_x
    1.0
  end
  #--------------------------------------------------------------------------
  # ● 飛入開始縱向放大率
  #--------------------------------------------------------------------------
  def slide_in_start_zoom_y
    1.0
  end
  #--------------------------------------------------------------------------
  # ● 飛出開始橫向放大率
  #--------------------------------------------------------------------------
  def slide_out_start_zoom_x
    1.0
  end
  #--------------------------------------------------------------------------
  # ● 飛出開始縱向放大率
  #--------------------------------------------------------------------------
  def slide_out_start_zoom_y
    1.0
  end
  #--------------------------------------------------------------------------
  # ● 飛入開始透明度
  #--------------------------------------------------------------------------
  def slide_in_start_opacity
    0
  end
  #--------------------------------------------------------------------------
  # ● 飛出開始透明度
  #--------------------------------------------------------------------------
  def slide_out_start_opacity
    255
  end
  #--------------------------------------------------------------------------
  # ● 取得飛入起始X座標
  #--------------------------------------------------------------------------
  def slide_in_start_x
    0
  end
  #--------------------------------------------------------------------------
  # ● 取得飛入起始Y座標
  #--------------------------------------------------------------------------
  def slide_in_start_y
    0
  end
  #--------------------------------------------------------------------------
  # ● 取得飛出起始X座標
  #--------------------------------------------------------------------------
  def slide_out_start_x
    0
  end
  #--------------------------------------------------------------------------
  # ● 取得飛出起始Y座標
  #--------------------------------------------------------------------------
  def slide_out_start_y
    0
  end
  #--------------------------------------------------------------------------
  # ● 取得橫向移動速度
  #--------------------------------------------------------------------------
  def x_speed
    0.0
  end
  #--------------------------------------------------------------------------
  # ● 取得縱向移動速度
  #--------------------------------------------------------------------------
  def y_speed
    0.0
  end
  #--------------------------------------------------------------------------
  # ● 多久刷新一次角度
  #--------------------------------------------------------------------------
  def angle_change_interval
    1
  end
  #--------------------------------------------------------------------------
  # ● 取得飛入翻轉起始角度
  #--------------------------------------------------------------------------
  def slide_in_start_angle
    0
  end
  #--------------------------------------------------------------------------
  # ● 取得飛入翻轉總角度
  #--------------------------------------------------------------------------
  def slide_in_total_angle
    0
  end
  #--------------------------------------------------------------------------
  # ● 取得飛出翻轉起始角度
  #--------------------------------------------------------------------------
  def slide_out_start_angle
    0
  end
  #--------------------------------------------------------------------------
  # ● 取得飛出翻轉總角度
  #--------------------------------------------------------------------------
  def slide_out_total_angle
    0
  end
  #--------------------------------------------------------------------------
  # ● 取得滑行時間
  #--------------------------------------------------------------------------
  def slide_time
    60
  end
  #--------------------------------------------------------------------------
  # ● X方向下限
  #--------------------------------------------------------------------------
  def x_min
    0.0
  end
  #--------------------------------------------------------------------------
  # ● X方向上限
  #--------------------------------------------------------------------------
  def x_max
    0.0
  end
  #--------------------------------------------------------------------------
  # ● Y方向下限
  #--------------------------------------------------------------------------
  def y_min
    0.0
  end
  #--------------------------------------------------------------------------
  # ● Y方向上限
  #--------------------------------------------------------------------------
  def y_max
    0.0
  end
  #--------------------------------------------------------------------------
  # ● 取得飛入翻轉速度
  #--------------------------------------------------------------------------
  def slide_in_angle_speed
    ((slide_in_total_angle * angle_change_interval).to_f / slide_time )
  end

  #--------------------------------------------------------------------------
  # ● 取得飛出翻轉速度
  #--------------------------------------------------------------------------
  def slide_out_angle_speed
    ((slide_out_total_angle * angle_change_interval).to_f / slide_time )
  end

  #--------------------------------------------------------------------------
  # ● 取得橫向放大率速度(絕對值)
  #--------------------------------------------------------------------------
  def zoom_x_speed
    (  (  slide_in_start_zoom_x  - slide_out_start_zoom_x  )  / slide_time.to_f ).abs
  end
  #--------------------------------------------------------------------------
  # ● 取得縱向放大率速度(絕對值)
  #--------------------------------------------------------------------------
  def zoom_y_speed
    (  (  slide_in_start_zoom_y  - slide_out_start_zoom_y  )  / slide_time.to_f ).abs
  end
  #--------------------------------------------------------------------------
  # ● 取得透明度漸變速度
  #--------------------------------------------------------------------------
  def opacity_speed
    ( slide_out_start_opacity.to_f / slide_time )
  end

  #--------------------------------------------------------------------------
  # ● 是否限制飛入最終座標
  #--------------------------------------------------------------------------
  def limit_slide_in_pos
    false
  end
  #--------------------------------------------------------------------------
  # ● 進行飛入後的處理
  #--------------------------------------------------------------------------
  def process_slided_in
    puts "已飛入"
    process_slide_in_angle_adjust
  end
  #--------------------------------------------------------------------------
  # ● 進行飛出後的處理
  #--------------------------------------------------------------------------
  def process_slided_out
    puts "已飛出"
  end
 #--------------------------------------------------------------------------
  # ● 處理飛入角度修正
  #--------------------------------------------------------------------------
  def process_slide_in_angle_adjust
    final_change = slide_in_total_angle
    while final_change < 0
      final_change += 360
    end
    final_change = final_change % 360
    self.angle = slide_in_start_angle + final_change
  end
  #--------------------------------------------------------------------------
  # ● 設置移動速度
  #--------------------------------------------------------------------------
  def set_speed
    @x_speed = x_speed
    @y_speed = y_speed
    @opacity_speed = opacity_speed
    @zoom_x_speed = zoom_x_speed
    @zoom_y_speed = zoom_y_speed
    if @sliding_in
      @angle_speed = slide_in_angle_speed
    elsif @sliding_out
      @angle_speed = slide_out_angle_speed
    end
  end
  #--------------------------------------------------------------------------
  # ● 放大率速度調整，根據方向
  #--------------------------------------------------------------------------
  def zoom_speed_adjust
    if @sliding_in
      if slide_in_start_zoom_x > slide_out_start_zoom_x 
        @zoom_x_speed *= -1
      end
      if slide_in_start_zoom_y > slide_out_start_zoom_y
        @zoom_y_speed *= -1
      end
    elsif @sliding_out
      if slide_in_start_zoom_x < slide_out_start_zoom_x 
        @zoom_x_speed *= -1
      end
      if slide_in_start_zoom_y < slide_out_start_zoom_y
        @zoom_y_speed *= -1
      end
    end
  end
  #--------------------------------------------------------------------------
  # ● 更新畫面
  #--------------------------------------------------------------------------
  def update
    super
    update_light
  end
  #--------------------------------------------------------------------------
  # ● 更新畫面 - 低負載
  #--------------------------------------------------------------------------
  def update_light
    update_sliding
  end
  #--------------------------------------------------------------------------
  # ● 更新飛入飛出
  #--------------------------------------------------------------------------
  def update_sliding
    if @slide_count > 0
      #puts "更新滑動：#{@slide_count}"
      @slide_count -= 1
      if @sliding_in
        @real_opacity += @opacity_speed
        @real_x += @x_speed
        @real_y += @y_speed
      elsif @sliding_out
        @real_opacity -= @opacity_speed
        @real_x -= @x_speed
        @real_y -= @y_speed
      end
      self.zoom_x += @zoom_x_speed
      self.zoom_y += @zoom_y_speed
      process_angle_change
      if limit_slide_in_pos
        if @x_speed > 0
          if @real_x > x_max
            @real_x = x_max
          end
        elsif @x_speed < 0
          if @real_x < x_min
            @real_x = x_min
          end
        end
        if @y_speed > 0
          if @real_y > y_max
            @real_y = y_max
          end
        elsif @y_speed < 0
          if @real_y < y_min
            @real_y = y_min
          end
        end

      end
      self.opacity =  [@real_opacity , @opacity_max].min
      self.x = @real_x
      self.y = @real_y
    else
      if @sliding_in && !@in_process
        @in_process = true
        self.zoom_x = slide_out_start_zoom_x 
        self.zoom_y = slide_out_start_zoom_y
        process_slided_in
      elsif @sliding_out && !@out_process
        @out_process = true
        self.zoom_x = slide_in_start_zoom_x 
        self.zoom_y = slide_in_start_zoom_y
        process_slided_out
      end
      @sliding_in = false
      @sliding_out = false
    end
  end
  #--------------------------------------------------------------------------
  # ● 執行角度改變
  #--------------------------------------------------------------------------
  def process_angle_change
    if @angle_change_count > 0
      @angle_change_count -= 1
      return
    end
    @angle_change_count = angle_change_interval - 1
    @real_angle = @real_angle + @angle_speed
    while @real_angle < 0
      @real_angle += 360
    end
    @real_angle = @real_angle % 360
    self.angle = @real_angle
  end
  #--------------------------------------------------------------------------
  # ● 取得當前飛入飛出的完成度
  #--------------------------------------------------------------------------
  def slide_rate
    if @slide_count == 0
      return 0.0
    else
      (@slide_count + 1.0) / slide_time
    end
  end
  #--------------------------------------------------------------------------
  # ● 飛入
  #--------------------------------------------------------------------------
  def slide_in
    return if @slided_in
    @sliding_in = true
    @sliding_out = false
    set_speed
    self.x = slide_in_start_x
    self.y = slide_in_start_y
    self.zoom_x = slide_in_start_zoom_x
    self.zoom_y = slide_in_start_zoom_y
    self.angle = slide_in_start_angle
    @real_x = self.x.to_f
    @real_y = self.y.to_f
    @real_angle = self.angle.to_f
    self.opacity = slide_in_start_opacity
    @real_opacity = self.opacity.to_f
    @in_process = false
    @slided_in = true
    @slided_out = false
    @slide_count = slide_time
    zoom_speed_adjust
  end
  #--------------------------------------------------------------------------
  # ● 飛出
  #--------------------------------------------------------------------------
  def slide_out(reset_position = true)
    return if @slided_out
    @sliding_in = false
    @sliding_out = true
    set_speed
    self.x = slide_out_start_x if reset_position
    self.y = slide_out_start_y if reset_position
    self.zoom_x = slide_out_start_zoom_x if reset_position
    self.zoom_y = slide_out_start_zoom_y if reset_position
    self.angle = slide_out_start_angle if reset_position
    @real_x = self.x.to_f
    @real_y = self.y.to_f
    @real_angle = self.angle.to_f
    @real_opacity = slide_out_start_opacity.to_f
    @out_process = false
    @slided_in = false
    @slided_out = true
    @slide_count = slide_time
    zoom_speed_adjust
  end
  #--------------------------------------------------------------------------
  # ● 是否正在飛入飛出？
  #--------------------------------------------------------------------------
  def sliding?
    @slide_count > 0 && ( @sliding_in || @sliding_out )
  end
  #--------------------------------------------------------------------------
  # ● 是否已經飛入
  #--------------------------------------------------------------------------
  def slided_in?
    @slided_in && !sliding?
  end
  #--------------------------------------------------------------------------
  # ● 是否已經飛出
  #--------------------------------------------------------------------------
  def slided_out?
    @slided_out && !sliding?
  end
end