#encoding:utf-8
#==============================================================================
# ■ Sprite_Full
#------------------------------------------------------------------------------
# 　擁有完整強化的圖像精靈
#==============================================================================

class  Sprite_Full < Sprite_Base
  #--------------------------------------------------------------------------
  # ● 加入所有強化
  #--------------------------------------------------------------------------
  include SpriteDrawer
  include SpriteSensor
  include Lctseng::SpriteShadow
  include SpriteFader
  include SpriteSlider
  include SpriteZoomer
end