#encoding:utf-8

#*******************************************************************************************
#
#   ＊ 對話 - 立繪、其他圖像 ＊
#
#                       for RGSS3
#
#        Ver 1.03   2013.07.24
#
#   原作者：魂(Lctseng)，巴哈姆特論壇ID：play123
#   替"wer227942914(小羽貓咪)"撰寫的特製版本
#
#   轉載請保留此標籤
#
#   個人小屋連結：http://home.gamer.com.tw/homeindex.php?owner=play123
#
#   主要功能：
#                       一、將內建的對話框表情一律使用立繪來顯示，請勿使用內建表情圖
#                       二、視窗最底下將有說明文字，請注意只能把對話視窗放在最底下
#                       三、Z座標分別為：說明文字 > 選項視窗 > 立繪 > 對話視窗
#
#
#   更新紀錄：
#    Ver 1.00 ：
#    日期：2013.07.18
#    摘要：一、最初版本
#                 二、功能：內建的對話框表情一律使用立繪來顯示
#
#    Ver 1.01
#    日期：2013.07.18
#    摘要：一、修改內建功能：將對話視窗的Z座標調整到立繪之上
#                 二、新增了說明文字的圖片，Z座標比選項視窗還高
#
#    Ver 1.02
#    日期：2013.07.21
#    摘要：一、與另一個對話腳本"對話 - 選項、存檔、暫停"合併作用
#                 二、完成暫停功能處理
#
#    Ver 1.03
#    日期：2013.07.24
#    摘要：一、錯誤修復：幫助說明文字在離開菜單選單後會出現一下子的問題
#
#
#    撰寫摘要：一、此腳本修改或重新定義以下類別：
#                          1.Window_Message
#                          2.Window_ChoiceList
#
#                          二、此腳本新定義以下類別：
#                          1.Sprite_MessageFace
#                          2.Sprite_HelpPicture
#
#                          三、此腳本定義了以下可供修改設定的模組：
#                          1.Lctseng_Message_Face_Settings
#
#*******************************************************************************************



#==============================================================================
# ■ Lctseng_Message_Face_Settings
#------------------------------------------------------------------------------
# 　對話立繪設定
#==============================================================================
module Lctseng_Message_Face_Settings
  #--------------------------------------------------------------------------
  # ● 立繪XY調整，基準點為左下角
  #--------------------------------------------------------------------------
  Big_Face_Adjust_X = 0
  Big_Face_Adjust_Y = 0
  #--------------------------------------------------------------------------
  # ● 立繪Z座標設定
  #--------------------------------------------------------------------------
  Big_Face_Z = 50
  #--------------------------------------------------------------------------
  # ● 選項視窗Z座標設定，比立繪大就會疊在立繪上方
  #--------------------------------------------------------------------------
  Choice_List_Window_Z= 400
  #--------------------------------------------------------------------------
  # ● 說明圖片的檔名
  #--------------------------------------------------------------------------
  Help_Picture_File_Name = "Message_Help"
  #--------------------------------------------------------------------------
  # ● 說明圖片的Z座標
  #--------------------------------------------------------------------------
  Help_Picture_Z = 100
  #--------------------------------------------------------------------------
  # ● 對話視窗要留給說明圖片多少空間墊高
  #--------------------------------------------------------------------------
  Help_Picture_Height = -5
  #--------------------------------------------------------------------------
  # ● 暫停圖片的Z座標
  #--------------------------------------------------------------------------
  Pause_Picture_Z = 600
  #--------------------------------------------------------------------------
  # ● 暫停圖片的檔名
  #--------------------------------------------------------------------------
  Pause_Picture_File_Name = "Message_Pause"
  #--------------------------------------------------------------------------
  # ● 回顧視窗的Z座標
  #--------------------------------------------------------------------------
  Log_Window_Z = 700
  
end

#*******************************************************************************************
#
#   請勿修改從這裡以下的程式碼，除非你知道你在做什麼！
#   DO NOT MODIFY UNLESS YOU KNOW WHAT TO DO ! 
#
#*******************************************************************************************


#encoding:utf-8
#==============================================================================
# ■ Sprite_MessageFace
#==============================================================================

class Sprite_MessageFace < Sprite_Base
  #--------------------------------------------------------------------------
  # ● 加入設定模組
  #--------------------------------------------------------------------------
  include Lctseng_Message_Face_Settings
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #--------------------------------------------------------------------------
  def initialize(message_window,viewport = nil)
    super(viewport)
    @message_window = message_window
    @bitmap_visible = false
    self.z = Big_Face_Z
    self.visible = false
  end
  #--------------------------------------------------------------------------
  # ● 處理產生立繪，利用檔名與索引
  #--------------------------------------------------------------------------
  def process_big_face_by_name_and_index(name,index)
    self.bitmap = Cache.face(process_real_filename(name,index))
    #self.ox = self.bitmap.width
    self.oy = self.bitmap.height
    self.x =   Big_Face_Adjust_X
    self.y = Graphics.height + Big_Face_Adjust_Y
    @bitmap_visible = true
  end
  #--------------------------------------------------------------------------
  # ● 產生真正檔名
  #--------------------------------------------------------------------------
  def process_real_filename(name,index)
    return name
  end
  #--------------------------------------------------------------------------
  # ● 清除圖像
  #--------------------------------------------------------------------------
  def clear_face
    self.bitmap = nil
    @bitmap_visible = false
  end
  #--------------------------------------------------------------------------
  # ● 更新畫面
  #--------------------------------------------------------------------------
  def update
    super
    update_visibility
  end
  #--------------------------------------------------------------------------
  # ● 更新可視度
  #--------------------------------------------------------------------------
  def update_visibility
    self.visible = @bitmap_visible&&@message_window.open?&&!$game_system.message_pause
  end
  #--------------------------------------------------------------------------
  # ● 文字位移量
  #--------------------------------------------------------------------------
  def text_shift
    0
  end
end

#encoding:utf-8
#==============================================================================
# ■ Sprite_HelpPicture
#      對話框底下的幫助文字圖片精靈
#==============================================================================

class Sprite_HelpPicture < Sprite_Base
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #--------------------------------------------------------------------------
  def initialize(message_window,viewport = nil)
    super(viewport)
    @message_window = message_window
    self.bitmap = Cache.system(Lctseng_Message_Face_Settings::Help_Picture_File_Name)
    self.x = (Graphics.width - self.width) / 2
    self.y = 0
    self.z = Lctseng_Message_Face_Settings::Help_Picture_Z
    self.visible = false
  end
  #--------------------------------------------------------------------------
  # ● 更新畫面
  #--------------------------------------------------------------------------
  def update
    super
    update_visibility
  end
  #--------------------------------------------------------------------------
  # ● 更新可視度
  #--------------------------------------------------------------------------
  def update_visibility
    self.visible = @message_window.openness == 255 &&!$game_system.message_pause && $game_message.position == 2 && @message_window.y >= Graphics.height / 2
  end
  
  
  
end


#encoding:utf-8
#==============================================================================
# ■ Window_Message
#------------------------------------------------------------------------------
# 　顯示文字信息的窗口。
#==============================================================================

class Window_Message < Window_Base
  #--------------------------------------------------------------------------
  # ★ 方法重新定義
  #--------------------------------------------------------------------------
  unless $lctseng_alias_big_face
    alias lctseng_for_face_ex_at_Window_Message_for_Initialize initialize # 初始化對象
    alias lctseng_for_face_ex_at_Window_Message_for_Dispose dispose # 釋放
    alias lctseng_for_face_ex_at_Window_Message_for_Update update # 更新畫面
    alias lctseng_for_face_ex_at_Window_Message_for_New_page new_page # 翻頁處理
    alias lctseng_for_face_ex_at_Window_Message_for_Update_placement update_placement # 更新窗口的位置
    #alias lctseng_for_face_ex_at_Window_Message_for_
  end
  #--------------------------------------------------------------------------
  # ● 初始化對象 - 重新定義
  #--------------------------------------------------------------------------
  def initialize(*args,&block)
    lctseng_for_face_ex_at_Window_Message_for_Initialize(*args,&block)
    create_face_sprite
    create_help_sprite
  end
  #--------------------------------------------------------------------------
  # ● 建立臉圖精靈
  #--------------------------------------------------------------------------
  def create_face_sprite
    @face_sprite = Sprite_MessageFace.new(self,self.viewport)
  end
  #--------------------------------------------------------------------------
  # ● 建立說明列精靈
  #--------------------------------------------------------------------------
  def create_help_sprite
    @help_sprite = Sprite_HelpPicture.new(self,nil)
  end
  #--------------------------------------------------------------------------
  # ● 釋放 - 重新定義
  #--------------------------------------------------------------------------
  def dispose(*args,&block)
    lctseng_for_face_ex_at_Window_Message_for_Dispose(*args,&block)
    dispose_face_sprite
    dispose_help_sprite
  end
  #--------------------------------------------------------------------------
  # ● 釋放臉圖精靈
  #--------------------------------------------------------------------------
  def dispose_face_sprite
    @face_sprite.dispose
  end
  #--------------------------------------------------------------------------
  # ● 釋放說明列精靈
  #--------------------------------------------------------------------------
  def dispose_help_sprite
    @help_sprite.dispose
  end
  #--------------------------------------------------------------------------
  # ● 更新畫面 - 重新定義
  #--------------------------------------------------------------------------
  def update(*args,&block)
    lctseng_for_face_ex_at_Window_Message_for_Update(*args,&block)
    update_face_sprite
    update_help_sprite
  end
  #--------------------------------------------------------------------------
  # ● 更新臉圖精靈
  #--------------------------------------------------------------------------
  def update_face_sprite
    @face_sprite.update
  end
  #--------------------------------------------------------------------------
  # ● 更新幫助圖標精靈
  #--------------------------------------------------------------------------
  def update_help_sprite
    @help_sprite.update
  end
  #--------------------------------------------------------------------------
  # ● 獲取換行位置 - 修改定義
  #--------------------------------------------------------------------------
  def new_line_x
    return 100
  end
  #--------------------------------------------------------------------------
  # ● 翻頁處理 - 修改定義
  #--------------------------------------------------------------------------
  def new_page(text, pos)
    @face_sprite.process_big_face_by_name_and_index($game_message.face_name, $game_message.face_index)
    contents.clear
    reset_font_settings
    change_color(text_color(6))
    pos[:x] = new_line_x
    pos[:y] = 0
    pos[:new_x] = new_line_x
    pos[:height] = calc_line_height(text)
    @first_line_process = false
    clear_flags
  end
  #--------------------------------------------------------------------------
  # ● 更新窗口的位置 - 重新定義
  #--------------------------------------------------------------------------
  def update_placement(*args,&block)
    @help_sprite.update_visibility
    lctseng_for_face_ex_at_Window_Message_for_Update_placement(*args,&block)
    case @position
    when 0
      @help_sprite.y = 0
    when 1
      @help_sprite.y = (Graphics.height - @help_sprite.height) / 2
    when 2
      @help_sprite.y = Graphics.height - @help_sprite.height
    end

    if @position == 2
      self.y  -= Lctseng_Message_Face_Settings::Help_Picture_Height
      @gold_window.y -= Lctseng_Message_Face_Settings::Help_Picture_Height
    else
    end
  end
  #--------------------------------------------------------------------------
  # ● 紀錄所有視窗的可視度
  #--------------------------------------------------------------------------
  def record_window_visible
    @visible_hash = {}
    instance_variables.each do |varname|
      ivar = instance_variable_get(varname)
      if ivar.is_a?(Window)
        ivar.update 
        @visible_hash[ivar] = ivar.visible
        ivar.visible = false
      end
    end
    @face_sprite.update
  end
  #--------------------------------------------------------------------------
  # ● 回復所有視窗的可視度
  #--------------------------------------------------------------------------
  def restore_window_visible
    return if !@visible_hash
    @visible_hash.each_pair do |window,visible|
      window.visible = visible
      window.update
    end
  end
  #--------------------------------------------------------------------------
  # ● 更新背景精靈
  #--------------------------------------------------------------------------
  def update_back_sprite
    @back_sprite.visible = false
    self.opacity = 0
  end
end

#encoding:utf-8
#==============================================================================
# ■ Window_ChoiceList
#------------------------------------------------------------------------------
# 　此窗口使用于事件指令中的“顯示選項”的功能。
#==============================================================================

class Window_ChoiceList < Window_Command
  #--------------------------------------------------------------------------
  # ● 方法重新定義
  #--------------------------------------------------------------------------
  unless $lctseng_alias_big_face
    alias lctseng_alias_big_face_Window_ChoiceList_Update_placement update_placement # 更新窗口的位置
  end
  #--------------------------------------------------------------------------
  # ● 更新窗口的位置 - 重新定義
  #--------------------------------------------------------------------------
  def update_placement(*args,&block)
    lctseng_alias_big_face_Window_ChoiceList_Update_placement(*args,&block)
    self.z = Lctseng_Message_Face_Settings::Choice_List_Window_Z
  end
end
#==============================================================================
# ■ $lctseng_alias_big_face
#------------------------------------------------------------------------------
# 　防止F12干擾腳本重新定義的保護標籤
#==============================================================================
$lctseng_alias_big_face = true


