#encoding:utf-8
#==============================================================================
# ■ Lctseng::Sprite_MessagePause
#------------------------------------------------------------------------------
#     對話暫停的精靈
#==============================================================================
module Lctseng
class Sprite_MessagePause < Sprite
  #--------------------------------------------------------------------------
  # ● 定義實例變數
  #--------------------------------------------------------------------------
  attr_accessor :pause
  #--------------------------------------------------------------------------
  # ● 加入設定模組
  #--------------------------------------------------------------------------
  include SpriteFader
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #--------------------------------------------------------------------------
  def initialize(viewport)
    super(viewport)
    create_bitmap
    center_origin
    @center_oy = self.oy
    self.x = Graphics.width / 2
    self.opacity = 0
    @in_pause = false
    fader_init
    reset_motion
  end
  #--------------------------------------------------------------------------
  # ● 產生點陣圖
  #--------------------------------------------------------------------------
  def create_bitmap
    @bit_out = Cache.system('Message_Pause_out')
    @bit_in = Cache.system('Message_Pause_in')
    self.bitmap = @bit_out
  end
  #--------------------------------------------------------------------------
  # ● 重置動作
  #--------------------------------------------------------------------------
  def reset_motion
    @motion_count = 30
    @motion_phase = :up
    self.oy = @center_oy
  end
  #--------------------------------------------------------------------------
  # ● 更新
  #--------------------------------------------------------------------------
  def update
    super
    update_pause_phase
    fader_update
    update_motion
  end
  #--------------------------------------------------------------------------
  # ● 更新暫停狀態
  #--------------------------------------------------------------------------
  def update_pause_phase
    if @pause
      if !@in_pause
        @in_pause = true
        process_pause_start
      end
    else
      if @in_pause
        @in_pause = false
        process_pause_end
      end
    end
  end
  #--------------------------------------------------------------------------
  # ● 開始暫停處理
  #--------------------------------------------------------------------------
  def process_pause_start
    self.bitmap = @bit_out
    reset_motion
    fader_set_fade(255,10)
    self.flash(Color.new(255,255,255),5)
  end
  #--------------------------------------------------------------------------
  # ● 結束暫停處理
  #--------------------------------------------------------------------------
  def process_pause_end
    self.bitmap = @bit_in
    fader_set_fade(0,5)
  end
  #--------------------------------------------------------------------------
  # ● 更新移動動作
  #--------------------------------------------------------------------------
  def update_motion
    if @motion_count > 0
      @motion_count -= 1
    else
      @motion_count = 30
      case @motion_phase
      when :up
        @motion_phase = :down
        self.oy = 0
      when :down
        @motion_phase = :up
        self.oy = @center_oy
      end
    end
  end

end
end
