#encoding:utf-8
#==============================================================================
# ■ Game_Interpreter
#------------------------------------------------------------------------------
# 　事件指令的解釋器。
#   本類在 Game_Map、Game_Troop、Game_Event 類的內部使用。
#==============================================================================

class Game_Interpreter
  #--------------------------------------------------------------------------
  # ● 清除index倒退
  #--------------------------------------------------------------------------
  def clear_scene_rollback
    puts "清除index倒退"
    @need_rooback = 0
    $game_system.scene_rollback = 0
    
  end
  #--------------------------------------------------------------------------
  # ● 進入戰鬥
  #--------------------------------------------------------------------------
  def start_battle
    clear_scene_rollback
    SceneManager.call(CardBattle::Scene_CardBattle)
    wait(10)
  end
end
  
  
