#encoding:utf-8
#==============================================================================
# ■ Game_Party
#------------------------------------------------------------------------------
# 　管理隊伍的類。保存有金錢及物品的信息。本類的實例請參考 $game_party 。
#==============================================================================

class Game_Party < Game_Unit
  #--------------------------------------------------------------------------
  # ● 定義實例變量
  #--------------------------------------------------------------------------
  attr_accessor   :temp_gold
  attr_accessor   :temp_card_hash
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #--------------------------------------------------------------------------
  alias card_battle_initialize initialize
  def initialize(*args,&block)
    card_battle_initialize(*args,&block)
    @temp_gold = self.gold
    @temp_card_hash = {}
    @temp_card_hash.default = 0
  end
  #--------------------------------------------------------------------------
  # ● 確認購買
  #--------------------------------------------------------------------------
  def confirm_buy
    lose_gold(self.gold - @temp_gold)
    @temp_card_hash.each_pair do |id,num|
      $game_actors.gain_card(id,num)
    end
    clear_buy
  end
  #--------------------------------------------------------------------------
  # ● 清除購買
  #--------------------------------------------------------------------------
  def clear_buy
    @temp_gold = self.gold
    @temp_card_hash.clear
  end
end
