#encoding:utf-8
#==============================================================================
# ■ CardBattle::Game_BattleCard
#------------------------------------------------------------------------------
# 　戰鬥卡片的類別
#==============================================================================

module CardBattle
class Game_BattleCard
  #--------------------------------------------------------------------------
  # ● 定義實例變量
  #--------------------------------------------------------------------------
  attr_accessor :card_id # 卡片ID流水號
  attr_accessor :card_type # 卡片類型：攻擊(attack)、防禦(defend)、技能(skill)、特殊(special)
  attr_accessor :card_point # 卡片點數，僅限攻擊與防禦
  attr_accessor :card_skill_type # 卡片技能類別，僅限技能卡有效：速度型(speed)、攻擊型(attack)、法師型(magic)
  attr_accessor :card_effect # 卡片效果，僅限特殊與攻擊/魔法技能有效：攻擊型持續(attack_first)、無視防禦(real_damage)、恢復(recovery)、重新抽牌(deliver)、交換(exchange)、妨礙(interrupt)
  attr_accessor :price # 金額
  attr_accessor :used # 是否已經用過了
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #--------------------------------------------------------------------------
  def initialize
    clear_all_data
  end
  #--------------------------------------------------------------------------
  # ● 清除所有資料
  #--------------------------------------------------------------------------
  def clear_all_data
    @card_id = 0
    @card_type = :none
    @card_point = 0
    @card_skill_type = :none
    @card_effect = :none
    @price = 0
    @used = false
  end
  #--------------------------------------------------------------------------
  # ● 卡片價值，用於AI保留牌用
  #--------------------------------------------------------------------------
  def card_value
    case @card_type
    when :special
      return 25
    else
      return @card_point
    end
  end
  #--------------------------------------------------------------------------
  # ● 檢視內容
  #--------------------------------------------------------------------------
  def inspect
    return "ID：#{@card_id}，類別：#{@card_type}，點數：#{@card_point}，使用狀態：#{@used}"
  end
  #--------------------------------------------------------------------------
  # ● 卡片是否可使用
  #--------------------------------------------------------------------------
  def usable?
    !@used
  end
  #--------------------------------------------------------------------------
  # ● 是否為技能卡？
  #--------------------------------------------------------------------------
  def is_skill?
    @card_type == :skill
  end
  #--------------------------------------------------------------------------
  # ● 是否為某類別用的技能卡？若非技能卡回傳false
  #--------------------------------------------------------------------------
  def is_skill_for_type(target_type)
    return false if !is_skill?
    return @card_skill_type == target_type
  end
end
end