module DataManager
  #--------------------------------------------------------------------------
  # ● 生成存檔用的場景截圖
  #--------------------------------------------------------------------------
  def self.snapshot_for_save
    @save_bitmap.dispose if @save_bitmap
    @save_bitmap = Graphics.snap_to_bitmap
  end
  #--------------------------------------------------------------------------
  # ● 獲取存檔用的場景截圖
  #--------------------------------------------------------------------------
  def self.save_bitmap
    @save_bitmap
  end
end