#encoding:utf-8
#==============================================================================
# ■ Lctseng::Sprite_FileInfo
#------------------------------------------------------------------------------
#     存讀檔資訊精靈
#==============================================================================
module Lctseng
class Sprite_FileInfo < Sprite
  #--------------------------------------------------------------------------
  # ● 加入設定模組
  #--------------------------------------------------------------------------
  include SpriteDrawer
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #--------------------------------------------------------------------------
  def initialize(viewport)
    super(viewport)
    set_pos([100,423])
    create_bitmap
  end
  #--------------------------------------------------------------------------
  # ● 刷新
  #--------------------------------------------------------------------------
  def refresh(h)
    self.bitmap.clear
    if h
      dw = self.bitmap.width
      dh = line_height
      # 劇本
      str = h[:names]
      change_color(text_color(6))
      draw_text(0,0,dw,dh,str)
      # 所在地圖
      str = "所在地圖："+h[:map_name]
      change_color(text_color(0))
      draw_text(0,0,dw,dh,str,2)
      # 遊戲時間
      str = h[:playtime_s]
      change_color(text_color(0))
      draw_text(0,dh,dw,dh,str,0)
      # 存檔時間
      str = h[:time_log]
      change_color(text_color(0))
      draw_text(0,dh,dw,dh,str,2)
    end
  end
  #--------------------------------------------------------------------------
  # ● 產生位圖
  #--------------------------------------------------------------------------
  def create_bitmap
    self.bitmap = Bitmap.new(450,48)
  end
  #--------------------------------------------------------------------------
  # ● 釋放
  #--------------------------------------------------------------------------
  def dispose
    self.bitmap.dispose
    super
  end

end
end
