#encoding:utf-8
#==============================================================================
# ■ Scene_Load
#------------------------------------------------------------------------------
# 　读档画面
#==============================================================================

class Scene_Load < Scene_File
  #--------------------------------------------------------------------------
  # ● 取得精靈組class
  #--------------------------------------------------------------------------
  def spriteset_class
    Lctseng::Spriteset_Load
  end
  #--------------------------------------------------------------------------
  # ● 确定读档文件
  #--------------------------------------------------------------------------
  def on_savefile_ok
    super
    puts "確認讀檔：#{@index}"
    if DataManager.load_game(@index)
      on_load_success
    else
      Sound.play_buzzer
    end
  end
  #--------------------------------------------------------------------------
  # ● 读档成功时的处理
  #--------------------------------------------------------------------------
  def on_load_success
    Sound.play_load
    fadeout_all
    $game_system.on_after_load
    scene_class = DataManager.load_header(@index)[:scene_class]
    SceneManager.goto(Scene_Map)
  end
end
