#encoding:utf-8
#==============================================================================
# ■ Lctseng::Spriteset_ActorSelectButton
#------------------------------------------------------------------------------
#     處理選角色按鈕群的精靈組
#==============================================================================
module Lctseng
class Spriteset_ActorSelectButton
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #--------------------------------------------------------------------------
  def initialize(index_handler,index,viewport)
    @viewport = viewport
    @index_handler = index_handler
    set_index(index,false)
    create_spritesets
    @btns[@index].go_selected
  end
  #--------------------------------------------------------------------------
  # ● 設定index
  #--------------------------------------------------------------------------
  def set_index(index,se_play = true)
    if @index != index
      Sound.play_ok if se_play
      @index = index
      @index_handler.call(@index)
    end
  end
  #--------------------------------------------------------------------------
  # ● 產生精靈組
  #--------------------------------------------------------------------------
  def create_spritesets
    #按鈕組
    @btns = []
    2.times do |i|
      @btns.push(Sprite_ActorSelectButton.new(i,@viewport))
    end
  end
  #--------------------------------------------------------------------------
  # ● 釋放
  #--------------------------------------------------------------------------
  def dispose
    dispose_spritesets
  end
  #--------------------------------------------------------------------------
  # ● 釋放精靈組
  #--------------------------------------------------------------------------
  def dispose_spritesets
    @btns.each {|s| s.dispose}
  end
  #--------------------------------------------------------------------------
  # ● 更新
  #--------------------------------------------------------------------------
  def update
    update_spritesets
  end
  #--------------------------------------------------------------------------
  # ● 更新精靈組
  #--------------------------------------------------------------------------
  def update_spritesets
    @btns.each {|s| s.update}
  end
  #--------------------------------------------------------------------------
  # ● 觸發確認鍵
  #--------------------------------------------------------------------------
  def process_ok
    @btns.each_with_index do |s,i|
      if s.on
        set_index(i)
        break
      end
    end
    if @index >= 0
      @btns.each_with_index do |s,i|
        if @index == i
          s.go_selected
        else
          s.left_selected
        end
      end
    end
  end

end
end