#encoding:utf-8
#==============================================================================
# ■ Lctseng::Sprite_SelectActorInfo
#------------------------------------------------------------------------------
# 　顯示選角色素質的精靈
#==============================================================================
module Lctseng
class Sprite_SelectActorInfo < Sprite_Base
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #--------------------------------------------------------------------------
  def initialize(frame,viewport = nil)
    super(viewport)
    @frame = frame
    self.z = @frame.z + 3
    @base_shift = 0
    create_bitmap
  end
  #--------------------------------------------------------------------------
  # ● 產生圖案
  #--------------------------------------------------------------------------
  def create_bitmap
    self.bitmap = Bitmap.new(@frame.bitmap.width,@frame.bitmap.height)
  end
  #--------------------------------------------------------------------------
  # ● 清除
  #--------------------------------------------------------------------------
  def clear
    self.bitmap.clear
  end
  #--------------------------------------------------------------------------
  # ● 釋放
  #--------------------------------------------------------------------------
  def dispose
    super
    self.bitmap.dispose
  end
  #--------------------------------------------------------------------------
  # ● 繪製數字
  #--------------------------------------------------------------------------
  def draw_num(x,y,n,green = false)
    
    r = 1
    while(n/r >= 10)
      r *= 10
    end
    
    while r > 0
      d = n / r
      n %= r
      r /= 10
      puts "繪製數字：#{d}"
      if green
        b_map = Cache.win("Green_#{d}")
      else
        b_map = Cache.win("#{d}")
      end
      self.bitmap.blt(x,y,b_map,b_map.rect)
      x += b_map.width
    end
  end
  #--------------------------------------------------------------------------
  # ● 繪製資訊
  #--------------------------------------------------------------------------
  def draw_info
    # 說明文字
    draw_help
    # 原始數值
    draw_pre_value
  end
  #--------------------------------------------------------------------------
  # ● 繪製說明文字
  #--------------------------------------------------------------------------
  def draw_help
    b_map = Cache.picture('BattleSelectActor_AbilityName')
    self.bitmap.blt(0,0,b_map,b_map.rect)
  end
  #--------------------------------------------------------------------------
  # ● 繪製原始數值
  #--------------------------------------------------------------------------
  def draw_pre_value
    dx = 100 + @base_shift
    dy = 68
    3.times do |i|
      n = @actor.params(i)
      draw_num(dx,dy,n,true)
      dy += 42
    end
  end
  #--------------------------------------------------------------------------
  # ● 顯示資訊
  #--------------------------------------------------------------------------
  def show_info(actor_id)
    @actor = $game_actors[actor_id]
    self.x = @frame.x
    self.y = @frame.y
    draw_info
    start_animation_id(122)
  end
end
end
