#encoding:utf-8
#==============================================================================
# ■ CardBattle::Sprite_BattleModeCover
#------------------------------------------------------------------------------
# 　角色肖像中，顯示選擇模式的覆蓋精靈
#==============================================================================
module CardBattle
class Sprite_BattleModeCover < Sprite_Base
  #--------------------------------------------------------------------------
  # ● 加入淡入淡出模組
  #--------------------------------------------------------------------------
  include SpriteFader
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #--------------------------------------------------------------------------
  def initialize(card_set,viewport)
    super(viewport)
    @card_set = card_set # 設定所屬卡組
    set_pos(@card_set.mode_pos)
    create_bitmap
    self.opacity = 0
    fader_init
  end
  #--------------------------------------------------------------------------
  # ● 產生位圖
  #--------------------------------------------------------------------------
  def create_bitmap
    filenames = @card_set.mode_filename_list
    @atk =Cache.battle(filenames[0])
    @def =Cache.battle(filenames[1])
    self.bitmap = @atk
  end
  #--------------------------------------------------------------------------
  # ● 更新
  #--------------------------------------------------------------------------
  def update
    super
    fader_update
  end
  #--------------------------------------------------------------------------
  # ● 顯示
  #--------------------------------------------------------------------------
  def show
    puts "#{@card_set.class}顯示模式為：#{@card_set.battle_mode}"
    start_animation_id(116)
    fader_set_fade(255,30)
    case @card_set.battle_mode
    when :attack
      self.bitmap = @atk
    when :defend
      self.bitmap = @def
    end
  end
  #--------------------------------------------------------------------------
  # ● 隱藏
  #--------------------------------------------------------------------------
  def hide
    fader_set_fade(0,30)
  end

end
end
