#encoding:utf-8
#==============================================================================
# ■ CardBattle::Sprite_BattleCounterNumber
#------------------------------------------------------------------------------
# 　顯示計數器數值的精靈
#==============================================================================
module CardBattle
class Sprite_BattleCounterNumber < Sprite_FadingNumber
  #--------------------------------------------------------------------------
  # ● 建立圖片
  #--------------------------------------------------------------------------
  def create_bitmap
    self.bitmap = Bitmap.new(42,40)
    self.bitmap.font = BATTLE_COUNTER_FONT
  end
  #--------------------------------------------------------------------------
  # ● 重繪數值
  #--------------------------------------------------------------------------
  def redraw_value(val)
    self.bitmap.clear
    draw_text(self.bitmap.rect,generate_string(val),1) if val >= 0
  end
  #--------------------------------------------------------------------------
  # ● 產生字串
  #--------------------------------------------------------------------------
  def generate_string(val)
    if val < 10
      " #{val} "
    elsif val < +100
      " #{val}"
    else
      val.to_s
    end
  end
  
end
end
