#encoding:utf-8
#==============================================================================
# ■ CardBattle::Spriteset_BattleHp
#------------------------------------------------------------------------------
#   顯示戰鬥生命值的精靈組
#==============================================================================
module CardBattle
class Spriteset_BattleHp
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #--------------------------------------------------------------------------
  def initialize(card_set,viewport)
    @viewport = viewport
    @card_set = card_set # 設定所屬卡組
    @current_hp = @card_set.hp
    create_sprites
  end
  #--------------------------------------------------------------------------
  # ● 產生精靈
  #--------------------------------------------------------------------------
  def create_sprites
    @number_sprite = Sprite_BattleHpNumber.new(@viewport)
    @number_sprite.set_pos(@card_set.number_sprite_pos)
    @number_sprite.set_value(@current_hp)
  end
  #--------------------------------------------------------------------------
  # ● 釋放
  #--------------------------------------------------------------------------
  def dispose
    @number_sprite.dispose
  end
  #--------------------------------------------------------------------------
  # ● 更新
  #--------------------------------------------------------------------------
  def update
    update_check_hp_change
    @number_sprite.update
  end
  #--------------------------------------------------------------------------
  # ● 更新檢查HP改變
  #--------------------------------------------------------------------------
  def update_check_hp_change
    if @current_hp != @card_set.hp
      set_hp_change(@current_hp,@card_set.hp)
      @current_hp = @card_set.hp
    end
  end
  #--------------------------------------------------------------------------
  # ● 處理HP變動
  #--------------------------------------------------------------------------
  def set_hp_change(from,to)
    @number_sprite.set_value_fade(from,to)
  end
  #--------------------------------------------------------------------------
  # ● 是否效果中？
  #--------------------------------------------------------------------------
  def effect?
    @number_sprite.effect?
  end
end
end