#encoding:utf-8
#==============================================================================
# ■ CardBattle::Spriteset_PlayerBattleCards
#------------------------------------------------------------------------------
#    管理玩家方卡片
#==============================================================================
module CardBattle
class Spriteset_PlayerBattleCards < Spriteset_BattleCards
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #--------------------------------------------------------------------------
  def initialize(main_spriteset,viewport)
    super
  end
  #--------------------------------------------------------------------------
  # ● 鎖定所屬的卡組對象
  #--------------------------------------------------------------------------
  def set_card_set
    @card_set = CardBattleManager.p_cards
  end
  #--------------------------------------------------------------------------
  # ● 釋放
  #--------------------------------------------------------------------------
  def dispose
    super
  end
  #--------------------------------------------------------------------------
  # ● 更新
  #--------------------------------------------------------------------------
  def update
    super
  end
  #--------------------------------------------------------------------------
  # ● 卡片預備位置 ( 抽象方法 )
  #--------------------------------------------------------------------------
  def card_prepare_pos(index)
    CardBattle.player_prepare_pos(index)
  end
  #--------------------------------------------------------------------------
  # ● 設置發牌效果 
  #--------------------------------------------------------------------------
  def set_deliver_effect(card_sprite)
    puts "設置玩家發牌效果"
    super
    from = [Graphics.width + 100,PLAYER_CARD_PREPARE_Y]
    to = card_prepare_pos(card_sprite.index)
    card_sprite.slider_set_move(from,to,BATTLE_PLAYER_DELIVER_TIME)
    card_sprite.cover_card
    card_sprite.set_uncover_after_slide
  end
  #--------------------------------------------------------------------------
  # ● 回到發卡前的準備區
  #--------------------------------------------------------------------------
  def sprite_back_to_deliver_pos
    # 重置發牌前位置，但保留卡不動
    @cards.each do |sprite|
      next if sprite.reserved_card
      sprite.x = Graphics.width + 100
      sprite.y = PLAYER_CARD_PREPARE_Y
    end
  end
  #--------------------------------------------------------------------------
  # ● 重抽時的外部位置
  #--------------------------------------------------------------------------
  def redraw_outside_pos(sprite,from)
    [from[0],Graphics.height + sprite.height]
  end
  #--------------------------------------------------------------------------
  # ● 交換時時的離開位置
  #--------------------------------------------------------------------------
  def exchange_outside_pos(sprite,from)
    [from[0],250]
  end
  #--------------------------------------------------------------------------
  # ● 設置交換效果
  #--------------------------------------------------------------------------
  def set_exchange_effect(sprite)
    super
    sprite.set_uncover_after_slide
  end

  

  
  
end
end