#encoding:utf-8
#==============================================================================
# ■ CardBattle::Sprite_LoseCover
#------------------------------------------------------------------------------
# 　顯示失敗覆蓋的精靈
#==============================================================================
module CardBattle
class Sprite_LoseCover < Sprite_Base
  #--------------------------------------------------------------------------
  # ● 加入模組
  #--------------------------------------------------------------------------
  include SpriteFader
  include SpriteSlider
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #--------------------------------------------------------------------------
  def initialize(viewport = nil)
    super(viewport)
    self.bitmap = Cache.lose('Cover')
    self.oy = self.height
    fader_init
    slider_init
    slider_set_move(current_pos,[self.x,Graphics.height + self.oy],LOSE_COVER_TIME)
  end
  #--------------------------------------------------------------------------
  # ● 更新
  #--------------------------------------------------------------------------
  def update
    super
    fader_update
    slider_update
  end
  #--------------------------------------------------------------------------
  # ● 快轉
  #--------------------------------------------------------------------------
  def fast_forward
    fader_set_fade(0,LOSE_FAST_FORWARD_TIME)
  end
end
end
