#encoding:utf-8
#==============================================================================
# ■ CardBattle::Sprite_WinClear
#------------------------------------------------------------------------------
# 　顯示戰鬥勝利立繪的精靈
#==============================================================================
module CardBattle
class Sprite_WinClear < Sprite_Base
  #--------------------------------------------------------------------------
  # ● 加入模組
  #--------------------------------------------------------------------------
  include SpriteFader
  include SpriteZoomer
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #--------------------------------------------------------------------------
  def initialize(viewport = nil)
    super(viewport)
    create_bitmap
    self.opacity = 0
    center_origin
    self.x = 447
    self.y = 280
    @effect_time = WIN_CLEAR_TEXT_TIME
    zoomer_init
    fader_init
  end
  #--------------------------------------------------------------------------
  # ● 產生圖案
  #--------------------------------------------------------------------------
  def create_bitmap
    self.bitmap = Cache.win('Clear')
  end
  #--------------------------------------------------------------------------
  # ● 更新
  #--------------------------------------------------------------------------
  def update
    super
    update_start_effect
    fader_update
    zoomer_update
  end
  #--------------------------------------------------------------------------
  # ● 更新檢查開始效果
  #--------------------------------------------------------------------------
  def update_start_effect
    if @effect_time > 0
      @effect_time -= 1
      if @effect_time == 1
        # 開始效果
        start_effect
      end
    end
  end
  #--------------------------------------------------------------------------
  # ● 開始效果
  #--------------------------------------------------------------------------
  def start_effect
    fader_set_fade(255,WIN_CLEAR_EFFECT_TIME)
    zoomer_set_effect([1.5,1.5],[1.0,1.0],WIN_CLEAR_EFFECT_TIME)
    start_animation_id(125)
  end
end
end
