#encoding:utf-8

=begin
*******************************************************************************************

   ＊ 切換裝備組 ＊

                       for RGSS3

        Ver 1.01   2013.08.13

   原作者：魂(Lctseng)，巴哈姆特論壇ID：play123
   原文發表於：巴哈姆特RPG製作大師哈拉版

   轉載請保留此標籤

   個人小屋連結：http://home.gamer.com.tw/homeindex.php?owner=play123

   主要功能：
                       一、切換角色的裝備組

   更新紀錄：
    Ver 1.00 ：
    日期：2013.08.12
    摘要：一、最初版本


    Ver 1.01：
    日期：2013.08.13
    摘要：一、新增了修改最大裝備組的數量功能
                 二、新增裝備視窗指令：切換裝備，可用於切換裝備組


    撰寫摘要：一、此腳本修改或重新定義以下類別：
                          1.Game_Actor
                          2.Window_EquipCommand
                          3.Window_EquipStatus
                          4.Scene_Equip
                          
                          
                          二、此腳本新定義以下類別和模組：
                          1.Window_EquipSet
                          
                          三、此腳本定義了以下可供修改設定的模組：
                          1.Lctseng::EquipSet

*******************************************************************************************

=end

#==============================================================================
# ■ Lctseng::EquipSet
#------------------------------------------------------------------------------
# 　有關多重裝備組的設定
#==============================================================================
module Lctseng
module EquipSet
  #--------------------------------------------------------------------------
  # ● 最大的裝備組數量
  #--------------------------------------------------------------------------
  Max_Set_Number = 3
  
  
end
end


#*******************************************************************************************
#
#   請勿修改從這裡以下的程式碼，除非你知道你在做什麼！
#   DO NOT MODIFY UNLESS YOU KNOW WHAT TO DO ! 
#
#*******************************************************************************************



#encoding:utf-8
#==============================================================================
# ■ Game_Actor
#------------------------------------------------------------------------------
# 　管理角色的類。
#   本類在 Game_Actors 類 ($game_actors) 的內部使用。
#   具體使用請查看 Game_Party 類 ($game_party) 。
#==============================================================================

class Game_Actor < Game_Battler
  #--------------------------------------------------------------------------
  # ★ 方法重新定義
  #--------------------------------------------------------------------------
  unless @lctseng_for_equip_set_on_Game_Actor_alias
    alias lctseng_for_equip_set_on_Game_Actor_for_Setup setup # 設置
    #alias lctseng_for_equip_set_on_Game_Actor_for_
    @lctseng_for_equip_set_on_Game_Actor_alias  = true
  end
  #--------------------------------------------------------------------------
  # ● 定義實例變數
  #--------------------------------------------------------------------------
  attr_reader :equip_set_index
  #--------------------------------------------------------------------------
  # ● 設置 - 重新定義
  #--------------------------------------------------------------------------
  def setup(*args,&block)
    @equip_set = []
    @equip_set_index = 0
    lctseng_for_equip_set_on_Game_Actor_for_Setup(*args,&block)
    init_equip_set
    @equip_set.insert(0,@equips)
  end
  #--------------------------------------------------------------------------
  # ● 初始化多重裝備組
  #--------------------------------------------------------------------------
  def init_equip_set
    @equip_set = []
    (max_equip_set-1).times do
      arr = Array.new(equip_slots.size) { Game_BaseItem.new }
      @equip_set.push(arr)
    end
  end
  #--------------------------------------------------------------------------
  # ● 取得最大組合數
  #--------------------------------------------------------------------------
  def max_equip_set
    return Lctseng::EquipSet::Max_Set_Number
  end
  #--------------------------------------------------------------------------
  # ● 位移組合
  #--------------------------------------------------------------------------
  def shift_set
    @equip_set_index += 1
    if @equip_set_index >= max_equip_set 
      @equip_set_index = 0
    end
    @equips = @equip_set[@equip_set_index]
    refresh
  end
  #--------------------------------------------------------------------------
  # ● 更換組合
  #--------------------------------------------------------------------------
  def change_set(id)
    if id >= max_equip_set
      id = max_equip_set - 1
    elsif id < 0
      id = 0
    end
    @equip_set_index = id
    @equips = @equip_set[@equip_set_index]
    puts "已更換裝備組至#{@equip_set_index}"
    refresh
  end
end


#encoding:utf-8
#==============================================================================
# ■ Window_EquipCommand
#------------------------------------------------------------------------------
# 　技能畫面中，選擇指令（更換裝備／最強裝備／全部卸下）的窗口。
#==============================================================================

class Window_EquipCommand < Window_Command
  #--------------------------------------------------------------------------
  # ● 獲取顯示行數
  #--------------------------------------------------------------------------
  def visible_line_number
    return 2
  end
  #--------------------------------------------------------------------------
  # ● 獲取行數 - 修改定義
  #--------------------------------------------------------------------------
  def col_max
    return 2
  end
  #--------------------------------------------------------------------------
  # ● 獲取列數 - 修改定義
  #--------------------------------------------------------------------------
  def row_max
    return 2
  end
  #--------------------------------------------------------------------------
  # ● 生成指令列表 - 修改定義
  #--------------------------------------------------------------------------
  def make_command_list
    add_command(Vocab::equip2,   :equip)
    add_command(Vocab::optimize, :optimize)
    add_command("裝備切換", :change_set)
    add_command(Vocab::clear,    :clear)
  end
end


##encoding:utf-8
#==============================================================================
# ■ Window_EquipStatus
#------------------------------------------------------------------------------
# 　裝備畫面中，顯示角色能力值變化的窗口。
#==============================================================================

class Window_EquipStatus < Window_Base
  #--------------------------------------------------------------------------
  # ● 獲取顯示行數 - 修改定義
  #--------------------------------------------------------------------------
  def visible_line_number
    return 8
  end
end


#encoding:utf-8
#==============================================================================
# ■ Window_EquipSet
#------------------------------------------------------------------------------
# 　裝備畫面中，選擇裝備組的視窗
#==============================================================================

class Window_EquipSet < Window_Selectable
  #--------------------------------------------------------------------------
  # ● 初始化對象
  #--------------------------------------------------------------------------
  def initialize
    ww = window_width
    wh = fitting_height(visible_line_number)
    wx = (Graphics.width - ww ) / 2
    wy = (Graphics.height - wh ) / 2
    super(wx, wy, ww,wh)
    refresh
    self.openness = 0
    deactivate
  end
  #--------------------------------------------------------------------------
  # ● 獲取視窗寬度
  #--------------------------------------------------------------------------
  def window_width
    return 200
  end
  #--------------------------------------------------------------------------
  # ● 獲取項目數
  #--------------------------------------------------------------------------
  def item_max
    return Lctseng::EquipSet::Max_Set_Number
  end
  #--------------------------------------------------------------------------
  # ● 獲取顯示行數
  #--------------------------------------------------------------------------
  def visible_line_number
    return item_max
  end
  #--------------------------------------------------------------------------
  # ● 獲取行數 
  #--------------------------------------------------------------------------
  def col_max
    return 1
  end
  #--------------------------------------------------------------------------
  # ● 獲取列數
  #--------------------------------------------------------------------------
  def row_max
    return item_max
  end
  #--------------------------------------------------------------------------
  # ● 繪製項目
  #--------------------------------------------------------------------------
  def draw_item(index)
    chr = (index + 65).chr
    rect = item_rect_for_text(index)
    draw_text(rect,sprintf("%s.裝備組",chr))
    
    
  end
end

#encoding:utf-8
#==============================================================================
# ■ Scene_Equip
#------------------------------------------------------------------------------
# 　裝備畫面
#==============================================================================

class Scene_Equip < Scene_MenuBase
  #--------------------------------------------------------------------------
  # ★ 方法重新定義
  #--------------------------------------------------------------------------
  unless @lctseng_for_equip_set_on_Scene_Equip_alias
    alias lctseng_for_equip_set_on_Scene_Equip_for_Start start # 開始處理
    alias lctseng_for_equip_set_on_Scene_Equip_for_Create_command_window create_command_window # 生成指令窗口
    #alias lctseng_for_equip_set_on_Scene_Equip_for_
    @lctseng_for_equip_set_on_Scene_Equip_alias  = true
  end
  #--------------------------------------------------------------------------
  # ● 開始處理
  #--------------------------------------------------------------------------
  def start
    lctseng_for_equip_set_on_Scene_Equip_for_Start
    create_set_window
  end
  #--------------------------------------------------------------------------
  # ● 建立裝備組視窗
  #--------------------------------------------------------------------------
  def create_set_window
    @set_window = Window_EquipSet.new
    @set_window.viewport = @viewport
    @set_window.set_handler(:ok,     method(:on_set_ok))
    @set_window.set_handler(:cancel, method(:on_set_cancel))
  end
  #--------------------------------------------------------------------------
  # ● 生成指令窗口 - 重新定義
  #--------------------------------------------------------------------------
  def create_command_window
    lctseng_for_equip_set_on_Scene_Equip_for_Create_command_window
    @command_window.set_handler(:change_set, method(:command_change_set))
  end
  #--------------------------------------------------------------------------
  # ● 裝備組：確定
  #--------------------------------------------------------------------------
  def on_set_ok
    @actor.change_set(@set_window.index)
    @set_window.close
    @command_window.activate
    @status_window.refresh
    @slot_window.refresh
  end
  #--------------------------------------------------------------------------
  # ● 裝備組：取消
  #--------------------------------------------------------------------------
  def on_set_cancel
    @set_window.close
    @command_window.activate
  end
  #--------------------------------------------------------------------------
  # ● 指令：更換裝備組
  #--------------------------------------------------------------------------
  def command_change_set
    @set_window.select(@actor.equip_set_index)
    @set_window.open
    @set_window.activate
  end
end

