#encoding:utf-8

=begin
*******************************************************************************************

   ＊ 時間自動HP/MP恢復 ＊

                       for RGSS3

        Ver 1.10   2014.04.21

   原作者：魂(Lctseng)，巴哈姆特論壇ID：play123
   原文發表於：巴哈姆特RPG製作大師哈拉版

   轉載請保留此標籤

   個人小屋連結：http://home.gamer.com.tw/homeindex.php?owner=play123

   主要功能：
                       一、固定時間後恢復角色HP與MP
                       二、可指定在某開關開啟之後才進行有恢復效果

   更新紀錄：
    Ver 1.00 ：
    日期：2013.11.17
    摘要：一、最初版本

    Ver 1.10 ：
    日期：2014.04.21
    摘要：一、新增功能：
                        1.可指定在某開關開啟之後才進行有恢復效果

    


    撰寫摘要：一、此腳本修改或重新定義以下類別：
                          1.Game_Player
                          
                          二、此腳本定義了以下可供修改設定的模組：
                          1.Lctseng::AutoRecovery
                          

*******************************************************************************************

=end

#encoding:utf-8
#==============================================================================
# ■ Lctseng::AutoRecovery
#------------------------------------------------------------------------------
# 　設定自動恢復的基本參數
#==============================================================================
module Lctseng
module AutoRecovery
  #--------------------------------------------------------------------------
  # ● 每多少畫格恢復一次，60畫格為1秒
  #--------------------------------------------------------------------------
  Recovery_Interval = 60
  #--------------------------------------------------------------------------
  # ● 開啟哪一個開關以後，才開始倒數恢復時間並進行恢復
  #--------------------------------------------------------------------------
  RECOVER_ACTIVE_SWITCH = 5
  
  
end
end


#*******************************************************************************************
#
#   請勿修改從這裡以下的程式碼，除非你知道你在做什麼！
#   DO NOT MODIFY UNLESS YOU KNOW WHAT TO DO ! 
#
#*******************************************************************************************


#--------------------------------------------------------------------------
# ★ 紀錄腳本資訊
#--------------------------------------------------------------------------
if !$lctseng_scripts  
  $lctseng_scripts = {}
end
$lctseng_scripts[:auto_recovery] = "1.10"

puts "載入腳本：Lctseng - 時間自動HP/MP恢復，版本：#{$lctseng_scripts[:auto_recovery]}"


#==============================================================================
# ■ Game_Player
#------------------------------------------------------------------------------
# 　處理玩家人物的類。擁有事件啟動的判定、地圖的卷動等功能。
#   本類的實例請參考 $game_player 。
#==============================================================================

class Game_Player
  #--------------------------------------------------------------------------
  # ★ 方法重新定義
  #--------------------------------------------------------------------------
  unless @lctseng_for_auto_recovery_on_Game_Player_alias
    alias lctseng_for_auto_recovery_on_Game_Player_for_Update update # 更新畫面
    @lctseng_for_auto_recovery_on_Game_Player_alias = true
  end
  #--------------------------------------------------------------------------
  # ● 更新畫面 - 重新定義
  #--------------------------------------------------------------------------
  def update
    lctseng_for_auto_recovery_on_Game_Player_for_Update
    if !@recovery_count
      @recovery_count = Lctseng::AutoRecovery::Recovery_Interval
    end
    if $game_switches[Lctseng::AutoRecovery::RECOVER_ACTIVE_SWITCH]
      if @recovery_count > 0
        @recovery_count -= 1
      else
        process_auto_recovery
        @recovery_count = Lctseng::AutoRecovery::Recovery_Interval
      end
    end
  end
  #--------------------------------------------------------------------------
  # ● 執行自動恢復
  #--------------------------------------------------------------------------
  def process_auto_recovery
    ## 在這裡定義你對自動恢復的方法
    
    ## 例如：每次讓角色1恢復10HP，即使不在隊伍中
    $game_actors[1].hp += 10
    
    ## 例如：每次讓角色2恢復5MP，角色2必須在隊伍中
    if $game_party.members.include?($game_actors[2])
      $game_actors[2].mp += 5
    end
    
    ## 例如：每次讓角色9恢復10%的HP，角色9必須在隊伍中
    if $game_party.members.include?($game_actors[9])
      _actor = $game_actors[9]
      _actor.hp += (_actor.mhp * 0.1).round
    end
    
  end
end

