#encoding:utf-8

=begin
*******************************************************************************************

   ＊ 簡化選單 - 魔女之家(多人橫版) ＊

                       for RGSS3

        Ver 1.00   2015.01.21

   原作者：魂(Lctseng)，巴哈姆特論壇ID：play123

   轉載請保留此標籤

   個人小屋連結：http://home.gamer.com.tw/homeindex.php?owner=play123

   主要功能：
            一、與魔女之家相仿的選單
            二、修改為支援多人，移除生命顯示
            三、修改為橫版


   更新紀錄：
    Ver 1.00 ：
    日期：2015.01.20
    摘要：(最初版本)
            一、與魔女之家相仿的選單
            二、修改為支援多人，移除生命顯示
            三、修改為橫版


            
            
    撰寫摘要：
             一、此腳本修改或重新定義以下類別：
                1.Window_MenuCommand
                2.Window_MenuStatus
                3.Scene_Menu

                          

*******************************************************************************************

=end

#*******************************************************************************************
#
#   請勿修改從這裡以下的程式碼，除非你知道你在做什麼！
#   DO NOT MODIFY UNLESS YOU KNOW WHAT TO DO ! 
#
#*******************************************************************************************

#--------------------------------------------------------------------------
# ★ 紀錄腳本資訊
#--------------------------------------------------------------------------
if !$lctseng_scripts  
  $lctseng_scripts = {}
end
_sym = :simplified_menu_multiactor_horz
$lctseng_scripts[_sym] = "1.00"

puts "載入腳本：Lctseng - 簡化選單 - 魔女之家(多人橫版)，版本：#{$lctseng_scripts[_sym]}"


module Lctseng
module SimplifiedMenu
  COMMAND_WIDTH = Graphics.width - 110 * 4 
end
end



#encoding:utf-8
#==============================================================================
# ■ Scene_Menu
#------------------------------------------------------------------------------
# 　菜單畫面
#==============================================================================

class Scene_Menu < Scene_MenuBase
  #--------------------------------------------------------------------------
  # ★ 方法重新定義
  #--------------------------------------------------------------------------
  unless @lctseng_simple_menu_on_Scene_Menu_alias
    alias lctseng_simple_menu_on_Scene_Menu_Create_command_window create_command_window # 生成指令窗口
    alias lctseng_simple_menu_on_Scene_Menu_Create_status_window create_status_window # 生成狀態窗口
    @lctseng_simple_menu_on_Scene_Menu_alias = true
  end
  #--------------------------------------------------------------------------
  # ● 開始處理 - 修改定義
  #--------------------------------------------------------------------------
  def start
    super
    create_command_window
    ### create_gold_window # 移除金錢視窗
    create_status_window
  end
  #--------------------------------------------------------------------------
  # ● 生成指令窗口 - 重新定義
  #--------------------------------------------------------------------------
  def create_command_window(*args,&block)
    lctseng_simple_menu_on_Scene_Menu_Create_command_window(*args,&block)
  end
  #--------------------------------------------------------------------------
  # ● 生成狀態窗口 - 重新定義
  #--------------------------------------------------------------------------
  def create_status_window(*args,&block)
    lctseng_simple_menu_on_Scene_Menu_Create_status_window(*args,&block)
    # 重新調整視窗位置
    @status_window.y = Graphics.height - @status_window.height
    @command_window.y = Graphics.height - @status_window.height + (@status_window.height - @command_window.height ) / 2
  end
end



#encoding:utf-8
#==============================================================================
# ■ Window_MenuCommand
#------------------------------------------------------------------------------
# 　菜單畫面中顯示指令的窗口
#==============================================================================

class Window_MenuCommand < Window_Command
  #--------------------------------------------------------------------------
  # ● 生成指令列表 - 修改定義
  #--------------------------------------------------------------------------
  def make_command_list
    add_main_commands
    ## 移除部分指令
    add_save_command
    add_game_end_command
  end
  #--------------------------------------------------------------------------
  # ● 向指令列表添加主要的指令 - 修改定義
  #--------------------------------------------------------------------------
  def add_main_commands
    add_command(Vocab::item,   :item,   main_commands_enabled)
    ## 移除部分指令
  end
  #--------------------------------------------------------------------------
  # ● 獲取窗口的寬度
  #--------------------------------------------------------------------------
  def window_width
    return Lctseng::SimplifiedMenu::COMMAND_WIDTH
  end

end

#encoding:utf-8
#==============================================================================
# ■ Window_MenuStatus
#------------------------------------------------------------------------------
# 　菜單畫面中，顯示隊伍成員狀態的窗口
#==============================================================================

class Window_MenuStatus < Window_Selectable
  #--------------------------------------------------------------------------
  # ● 獲取窗口的寬度
  #--------------------------------------------------------------------------
  def window_width
    Graphics.width - Lctseng::SimplifiedMenu::COMMAND_WIDTH
  end
  #--------------------------------------------------------------------------
  # ● 獲取行間距的寬度
  #--------------------------------------------------------------------------
  def spacing
    return 3
  end
  #--------------------------------------------------------------------------
  # ● 獲取窗口的高度 - 修改定義
  #--------------------------------------------------------------------------
  def window_height
     150
  end
  #--------------------------------------------------------------------------
  # ● 獲取項目數 - 修改定義
  #--------------------------------------------------------------------------
  def item_max
    $game_party.members.size
  end
  #--------------------------------------------------------------------------
  # ● 獲取項目數 - 修改定義
  #--------------------------------------------------------------------------
  def row_max
    1
  end
  #--------------------------------------------------------------------------
  # ● 獲取項目數 - 修改定義
  #--------------------------------------------------------------------------
  def col_max
    4
  end
  #--------------------------------------------------------------------------
  # ● 獲取項目的高度
  #--------------------------------------------------------------------------
  def item_height
    (height - standard_padding * 2) / item_max
  end
  #--------------------------------------------------------------------------
  # ● 繪制簡單的狀態 - 修改定義
  #--------------------------------------------------------------------------
  def draw_actor_simple_status(actor, x, y)
    draw_actor_name(actor, x - 96, y + 90)
    #draw_actor_level(actor, x, y + line_height * 1)
    draw_actor_icons(actor, x, y + line_height * 2)
    #draw_actor_class(actor, x + 120, y)
    ##draw_actor_hp(actor, x + 120, y + line_height * 1)
    ## draw_actor_mp(actor, x + 120, y + line_height * 2) # 移除MP繪製
  end
end

