#encoding:utf-8

=begin
*******************************************************************************************

   ＊ 自動選擇選項 ＊

                       for RGSS3

        Ver 1.00   2013.02.03

   原作者：魂(Lctseng)，巴哈姆特論壇ID：play123
   原文發表於：巴哈姆特RPG製作大師哈拉版

   轉載請保留此標籤

   個人小屋連結：http://home.gamer.com.tw/homeindex.php?owner=play123

   主要功能：
                       一、指定時間後，自動選擇某選項

   更新紀錄：
    Ver 1.00 ：
    日期：2013.02.03
    摘要：一、最初版本



    撰寫摘要：一、此腳本修改或重新定義以下類別：
                          1.Game_Message
                          2.Game_Interpreter
                          3.Window_ChoiceList
                          
                         

*******************************************************************************************

=end

#*******************************************************************************************
#
#   請勿修改從這裡以下的程式碼，除非你知道你在做什麼！
#   DO NOT MODIFY UNLESS YOU KNOW WHAT TO DO ! 
#
#*******************************************************************************************


#encoding:utf-8
#==============================================================================
# ■ Game_Message
#------------------------------------------------------------------------------
# 　處理信息窗口狀態、文字顯示、選項等的類。本類的實例請參考 $game_message 。
#==============================================================================

class Game_Message
  #--------------------------------------------------------------------------
  # ● 定義實例變量
  #--------------------------------------------------------------------------
  attr_accessor :default_choice                # 時間到時預設選項
  attr_accessor :max_time               # 最大等待時間
  #--------------------------------------------------------------------------
  # ● 方法重定義
  #--------------------------------------------------------------------------
  unless @lctseng_for_autoselect_alias
    alias lctseng_for_autoselect_Clear clear
    @lctseng_for_autoselect_alias = true
  end
  #--------------------------------------------------------------------------
  # ● 清除
  #--------------------------------------------------------------------------
  def clear
    lctseng_for_autoselect_Clear
    @default_choice = -1
    @max_time  = 0
  end
end


#encoding:utf-8
#==============================================================================
# ■ Game_Interpreter
#------------------------------------------------------------------------------
# 　事件指令的解釋器。
#   本類在 Game_Map、Game_Troop、Game_Event 類的內部使用。
#==============================================================================

class Game_Interpreter
  #--------------------------------------------------------------------------
  # ● 設定自動選項
  #--------------------------------------------------------------------------
  def set_auto_select(default_choice,max_time)
    $game_message.default_choice  = default_choice - 1
    $game_message.max_time  = max_time
  end

end


#encoding:utf-8
#==============================================================================
# ■ Window_ChoiceList
#------------------------------------------------------------------------------
# 　此窗口使用于事件指令中的“顯示選項”的功能。
#==============================================================================

class Window_ChoiceList < Window_Command
  #--------------------------------------------------------------------------
  # ● 方法重定義
  #--------------------------------------------------------------------------
  unless @lctseng_for_autoselect_alias
    alias lctseng_for_autoselect_Initialize initialize
    alias lctseng_for_autoselect_Start start
    @lctseng_for_autoselect_alias = true
  end
  #--------------------------------------------------------------------------
  # ● 初始化對象 - 重新定義
  #--------------------------------------------------------------------------
  def initialize(message_window)
    lctseng_for_autoselect_Initialize(message_window)
    @default_choice = -1
    @remain_time = 0
    @max_time = 0
  end
  #--------------------------------------------------------------------------
  # ● 開始輸入的處理 - 重新定義
  #--------------------------------------------------------------------------
  def start
    get_autoselect_data
    lctseng_for_autoselect_Start
  end
 #--------------------------------------------------------------------------
  # ● 取得自動選擇的資料
  #--------------------------------------------------------------------------
  def get_autoselect_data
    @default_choice = $game_message.default_choice 
    @remain_time = @max_time = $game_message.max_time 
    $game_message.default_choice  = -1
    $game_message.max_time  = 0
  end
 #--------------------------------------------------------------------------
  # ● 更新
  #--------------------------------------------------------------------------
  def update
    super
    if $game_message.busy?&&@max_time > 0
      if self.active
        printf("時間剩餘:%3d，時間到後將自動選擇選項%d\n",@remain_time,@default_choice + 1)
        if @remain_time <= 0
          $game_message.choice_proc.call(@default_choice)
          deactivate
          close
        else
          @remain_time -= 1
        end
      end
    end
  end
end
