#encoding:utf-8

=begin
*******************************************************************************************

   ＊ 閃爍標題圖層 ＊

                       for RGSS3

        Ver 1.00   2014.04.16

   原作者：魂(Lctseng)，巴哈姆特論壇ID：play123
   原文發表於：巴哈姆特RPG製作大師哈拉版
   原為替替"william6k(KLL)"撰寫的特製版本
   

   轉載請保留此標籤

   個人小屋連結：http://home.gamer.com.tw/homeindex.php?owner=play123

   主要功能：
                       一、增加標題畫面中一個循環閃爍的動態圖層

   更新紀錄：
    Ver 1.00 ：
    日期：2014.04.16
    摘要：一、最初版本
                二、功能：                  
                       一、增加標題畫面中一個循環閃爍的動態圖層

    撰寫摘要：一、此腳本修改或重新定義以下類別：
                           1. Scene_Title
                           
                           
                        二、此腳本提供可供設定的模組：
                          1.Lctseng::Flash_Title
                           
                          

*******************************************************************************************

=end

#==============================================================================
# ■ Lctseng::Flash_Title
#------------------------------------------------------------------------------
# 　閃爍標題圖層設定用模組
#==============================================================================
module Lctseng
module Flash_Title
  #--------------------------------------------------------------------------
  # ● 閃爍時間設定
  #--------------------------------------------------------------------------
  # 淡入時間
  TITLE_FADEIN_TIME = 150
  # 淡出時間
  TITLE_FADEOUT_TIME = 150
  #--------------------------------------------------------------------------
  # ● 閃爍速度設定
  #--------------------------------------------------------------------------
  # 透明度淡入速度
  TITLE_FADEIN_SPEED = 1
  # 透明度淡出速度
  TITLE_FADEOUT_SPEED = 1
  #--------------------------------------------------------------------------
  # ● 閃爍上下限設定，僅限於閃爍時有效
  #--------------------------------------------------------------------------
  # 淡入時，最大透明度
  TITLE_MAX_FADEIN_OPACITY = 200
  # 淡出時，最小透明度
  TITLE_MIN_FADEOUT_OPACITY = 50
  #--------------------------------------------------------------------------
  # ● 圖層先後設定，Z座標越大，離玩家越近
  #--------------------------------------------------------------------------
  # 閃爍圖層的Z座標
  TITLE_FLASH_Z = 50
  # 原本的上層標題圖片Z座標
  TITLE_BACKGROUND_2_Z = 60
  
end
end



#*******************************************************************************************
#
#   請勿修改從這裡以下的程式碼，除非你知道你在做什麼！
#   DO NOT MODIFY UNLESS YOU KNOW WHAT TO DO ! 
#
#******************************************************************************************



#--------------------------------------------------------------------------
# ★ 紀錄腳本資訊
#--------------------------------------------------------------------------
if !$lctseng_scripts  
  $lctseng_scripts = {}
end
$lctseng_scripts[:flashing_title] = "1.00"

puts "載入腳本：Lctseng - 閃爍標題圖層，版本：#{$lctseng_scripts[:flashing_title]}"




#encoding:utf-8
#==============================================================================
# ■ Scene_Title
#------------------------------------------------------------------------------
# 　標題畫面
#==============================================================================

class Scene_Title < Scene_Base
  #--------------------------------------------------------------------------
  # ● 加入設定模組
  #--------------------------------------------------------------------------
  include Lctseng::Flash_Title
  #--------------------------------------------------------------------------
  # ● 開始處理 - 重新定義
  #--------------------------------------------------------------------------
  alias lct_flashing_title_Scene_Base_start start
  #--------------------------------------------------------------------------
  def start(*args,&block)
    lct_flashing_title_Scene_Base_start(*args,&block)
    create_flashing_sprite
  end
  #--------------------------------------------------------------------------
  # ● 產生閃爍精靈
  #--------------------------------------------------------------------------
  def create_flashing_sprite
    @flash_sprite = Sprite.new
    @flash_sprite.bitmap = Cache.system("TitleFlashing")
    @flash_sprite.z = TITLE_FLASH_Z
    @flash_sprite.opacity = 0
    @flash_count = TITLE_FADEIN_TIME + TITLE_FADEOUT_TIME
    center_sprite(@flash_sprite)
    @sprite2.z = TITLE_BACKGROUND_2_Z # 將第二層標題圖片覆蓋到閃爍物件上
  end
  #--------------------------------------------------------------------------
  # ● 結束處理 - 重新定義
  #--------------------------------------------------------------------------
  alias lct_flashing_title_Scene_Base_terminate terminate
  #--------------------------------------------------------------------------
  def terminate(*args,&block)
    lct_flashing_title_Scene_Base_terminate(*args,&block)
    dispose_flashing_sprite
  end
  #--------------------------------------------------------------------------
  # ● 釋放閃爍精靈
  #--------------------------------------------------------------------------
  def dispose_flashing_sprite
    @flash_sprite.bitmap.dispose
    @flash_sprite.dispose
  end
  #--------------------------------------------------------------------------
  # ● 更新畫面 (基礎)
  #--------------------------------------------------------------------------
  def update_basic
    super
    update_flashing_sprite
  end
  #--------------------------------------------------------------------------
  # ● 更新閃爍精靈
  #--------------------------------------------------------------------------
  def update_flashing_sprite
    if @flash_count > TITLE_FADEOUT_TIME
      @flash_sprite.opacity += TITLE_FADEIN_SPEED
      if @flash_sprite.opacity > TITLE_MAX_FADEIN_OPACITY
        @flash_sprite.opacity = TITLE_MAX_FADEIN_OPACITY
      end
      @flash_count -= 1
    elsif @flash_count <= 0
      @flash_sprite.opacity = TITLE_MIN_FADEOUT_OPACITY
      @flash_count = TITLE_FADEIN_TIME + TITLE_FADEOUT_TIME
    else
      @flash_sprite.opacity -= TITLE_FADEOUT_SPEED
      @flash_count -= 1
      if @flash_sprite.opacity < TITLE_MIN_FADEOUT_OPACITY
        @flash_sprite.opacity = TITLE_MIN_FADEOUT_OPACITY
      end


    end
    
  end
end
